# BottomOfPartElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..BottomOfPartElevation Property
FabricationPart Class See Also
---
The associated elevation to the bottom of fabrication part off of the current level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double BottomOfPartElevation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BottomOfPartElevation As Double
	Get
```

Visual C++
---
```text
public:
property double BottomOfPartElevation {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace